// Задача 19
// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.





// void Pal (int number)
// {
// int number1 = 1;
//     if (number1 >= 123)
//     {
//         System.Console.Write((number1 >= 321) + "да");
//         number1++;
//     else
//         Console.WriteLine("нет");
//     }
// }

// System.Console.WriteLine("Please, write number");
// int user = Convert.ToInt32(Console.ReadLine());
// Pal(user);




// Задача 21: Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.





// void Dist (int x1, int x2, int y1, int y2, int z1, int z2)
// {
//     double d =Math.Sqrt(Math.Pow((x2-x1),2)+Math.Pow((y2-y1),2)+Math.Pow((z2-z1),2));
//     Console.WriteLine($"Расстояние: {Math.Round(d,3)}");
// }

// Console.Write("Введите координату x1: ");
// int x1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите координату y1: ");
// int y1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите координату z1: ");
// int z1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите координату x2: ");
// int x2 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите координату y2: ");
// int y2 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите координату z2: ");
// int z2 = Convert.ToInt32(Console.ReadLine());

// Dist(x1, x2, y1, y2, z1, z2);




//Задача 23: Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.



// void Program (int number)
// {

//     for (int number1 = 1;number1 <= number; number1++)
//     {
//         System.Console.Write(number1*number1*number1 + " ");
//     }
// }
// System.Console.WriteLine("Please, write number");
// int num = Convert.ToInt32(Console.ReadLine());
// Program(num);
